Autonomy-Logic/logo8-arduino-core/boards.txt
menu.upload=Upload method

logo8.name=Siemens LOGO! 8.2 (Ethernet)
logo8.build.mcu=cortex-m4
logo8.build.f_cpu=120000000L
logo8.build.core=tivac
logo8.build.arch=tivac
logo8.build.variant=logo8
logo8.build.ldscript=logo8.ld
logo8.build.board=LOGO8_TM4C1294
logo8.upload.tool=logoeth
logo8.upload.protocol=logoeth
# 864 KB: flash from the app base 0x28000 to the end of the 1 MB part.
logo8.upload.maximum_size=884736
# 248 KB: SRAM above the 8 KB reserved for the bootloader's resident state.
logo8.upload.maximum_data_size=253952
